Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: إذ تمشي أختك فتقول هل أدلكم على من يكفله فرجعناك إلى أمك كي تقر عينها ولا تحزن وقتلت نفسا فنجيناك من الغم وفتناك فتونا فلبثت سنين في أهل مدين ثم جئت على قدر يا موسى
en: "When your sister went and said: 'Shall I show you one who will nurse him?' So We restored you to your mother, that she might cool her eyes and she should not grieve. Then you did kill a man, but We saved you from great distress and tried you with a heavy trial. Then you stayed a number of years with the people of Madyan (Midian). Then you came here according to the fixed term which I ordained (for you), O Musa (Moses)!

source: واصطنعتك لنفسي
en: "And I have chosen you, for Myself.

source: اذهب أنت وأخوك بآياتي ولا تنيا في ذكري
en: "Go you and your brother with My Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), and do not, you both, slacken and become weak in My Remembrance.

source: اذهبا إلى فرعون إنه طغى
en: "Go, both of you, to Fir'aun (Pharaoh), verily, he has transgressed (all bounds in disbelief and disobedience and behaved as an arrogant and as a tyrant).

source: فقولا له قولا لينا لعله يتذكر أو يخشى
en: "And speak to him mildly, perhaps he may accept admonition or fear (Allah)."

source: قالا ربنا إننا نخاف أن يفرط علينا أو أن يطغى
en: They said: "Our Lord! Verily we fear lest he should hasten to punish us or lest he should transgress (all bounds against us)."

source: قال لا تخافا إنني معكما أسمع وأرى
en: He (Allah) said: "Fear not, verily I am with you both, hearing and seeing.

source: فأتياه فقولا إنا رسولا ربك فأرسل معنا بني إسرائيل ولا تعذبهم قد جئناك بآية من ربك والسلام على من اتبع الهدى
en: "So go you both to him, and say: 'Verily, we are Messengers of your Lord, so let the Children of Israel go with us, and torment them not; indeed, we have come with a sign from your Lord! And peace will be upon him who follows the guidance!

source: إنا قد أوحي إلينا أن العذاب على من كذب وتولى
en: "Truly, it has been revealed to us that the torment will be for him who denies [believes not in the Oneness of Allah, and in His Messengers.], and turns away (from the truth and obedience of Allah)."

source: قال فمن ربكما يا موسى
en: Fir'aun (Pharaoh) said: "Who then, O Musa (Moses), is the Lord of you two?"

source: قال ربنا الذي أعطى كل شيء خلقه ثم هدى
en: [Musa (Moses)] said: "Our Lord is He Who gave to each thing its form and nature, then guided it aright."

source: قال فما بال القرون الأولى
en: [Fir'aun (Pharaoh)] said: "What about the generations of old?"

source: قال علمها عند ربي في كتاب لا يضل ربي ولا ينسى
en: [Musa (Moses)] said: "The knowledge thereof is with my Lord, in a Record. My Lord neither errs nor He forgets."

source: الذي جعل لكم الأرض مهدا وسلك لكم فيها سبلا وأنزل من السماء ماء فأخرجنا به أزواجا من نبات شتى
en: Who has made earth for you like a bed (spread out); and has opened roads (ways and paths) for you therein, and has sent down water (rain) from the sky. And We have brought forth with it various kinds of vegetation.

source: كلوا وارعوا أنعامكم إن في ذلك لآيات لأولي النهى
en: Eat and pasture your cattle (therein); verily, in this are Ayat (proofs and signs) for men of understanding.

source: منها خلقناكم وفيها نعيدكم ومنها نخرجكم تارة أخرى
en: Thereof (the earth) We created you, and into it We shall return you, and from it We shall bring you out once again.

source: ولقد أريناه آياتنا كلها فكذب وأبى
en: And indeed We showed him [Fir'aun (Pharaoh)] all Our Ayat (signs and evidence), but he denied and refused.

source: قال أجئتنا لتخرجنا من أرضنا بسحرك يا موسى
en: He [Fir'aun (Pharaoh)] said: "Have you come to drive us out of our land with your magic, O Musa (Moses)?

source: فلنأتينك بسحر مثله فاجعل بيننا وبينك موعدا لا نخلفه نحن ولا أنت مكانا سوى
en: "Then verily, we can produce magic the like thereof; so appoint a meeting between us and you, which neither we nor you shall fail to keep, in an open place where both shall have a just and equal chance (and beholders could witness the competition)."

source: قال موعدكم يوم الزينة وأن يحشر الناس ضحى
en: [Musa (Moses)] said: "Your appointed meeting is the day of the festival, and let the people assemble when the sun has risen (forenoon)."

source: فتولى فرعون فجمع كيده ثم أتى
en: So Fir'aun (Pharaoh) withdrew, devised his plot and then came back.

source: قال لهم موسى ويلكم لا تفتروا على الله كذبا فيسحتكم بعذاب وقد خاب من افترى
en: Musa (Moses) said to them: "Woe unto you! Invent not a lie against Allah, lest He should destroy you completely by a torment. And surely, he who invents a lie (against Allah) will fail miserably."

source: فتنازعوا أمرهم بينهم وأسروا النجوى
en: Then they debated one with another what they must do, and they kept their talk secret.

source: قالوا إن هذان لساحران يريدان أن يخرجاكم من أرضكم بسحرهما ويذهبا بطريقتكم المثلى
en: They said: "Verily these are two magicians. Their object is to drive you out from your land with magic, and overcome your chiefs and nobles.

source: فأجمعوا كيدكم ثم ائتوا صفا وقد أفلح اليوم من استعلى
en: "So devise your plot, and then assemble in line. And whoever overcomes this day will be indeed successful."

source: قالوا يا موسى إما أن تلقي وإما أن نكون أول من ألقى
en: They said: "O Musa (Moses)! Either you throw first or we be the first to throw?"

source: قال بل ألقوا فإذا حبالهم وعصيهم يخيل إليه من سحرهم أنها تسعى
en: [Musa (Moses)] said: "Nay, throw you (first)!" Then behold! their ropes and their sticks, by their magic, appeared to him as though they moved fast.

source: فأوجس في نفسه خيفة موسى
en: So Musa (Moses) conceived fear in himself.

source: قلنا لا تخف إنك أنت الأعلى
en: We (Allah) said: "Fear not! Surely, you will have the upper hand.

source: وألق ما في يمينك تلقف ما صنعوا إنما صنعوا كيد ساحر ولا يفلح الساحر حيث أتى
en: "And throw that which is in your right hand! It will swallow up that which they have made. That which they have made is only a magician's trick, and the magician will never be successful, to whatever amount (of skill) he may attain."

source: فألقي السحرة سجدا قالوا آمنا برب هارون وموسى
en: So the magicians fell down prostrate. They said: "We believe in the Lord of Harun (Aaron) and Musa (Moses)."

source: قال آمنتم له قبل أن آذن لكم إنه لكبيركم الذي علمكم السحر فلأقطعن أيديكم وأرجلكم من خلاف ولأصلبنكم في جذوع النخل ولتعلمن أينا أشد عذابا وأبقى
en: [Fir'aun (Pharaoh)] said: "Believe you in him [Musa (Moses)] before I give you permission? Verily he is your chief who has taught you magic. So I will surely cut off your hands and feet on opposite sides, and I will surely crucify you on the trunks of date-palms, and you shall surely know which of us [I (Fir'aun - Pharaoh) or the Lord of Musa (Moses) (Allah)] can give the severe and more lasting torment."

source: قالوا لن نؤثرك على ما جاءنا من البينات والذي فطرنا فاقض ما أنت قاض إنما تقضي هذه الحياة الدنيا
en: They said: "We prefer you not over what have come to us of the clear signs and to Him (Allah) Who created us. So decree whatever you desire to decree, for you can only decree (regarding) this life of the world.

source: إنا آمنا بربنا ليغفر لنا خطايانا وما أكرهتنا عليه من السحر والله خير وأبقى
en: "Verily we have believed in our Lord, that He may forgive us our faults, and the magic to which you did compel us. And Allah is better as regards reward in comparison to your [Fir'aun's (Pharaoh)] reward, and more lasting (as regards punishment in comparison to your punishment)."

source: إنه من يأت ربه مجرما فإن له جهنم لا يموت فيها ولا يحيى
en: Verily whoever comes to his Lord as a Mujrim (criminal, polytheist, sinner, disbeliever in the Oneness of Allah and His Messengers), then surely, for him is Hell, wherein he will neither die nor live.

source: ومن يأته مؤمنا قد عمل الصالحات فأولئك لهم الدرجات العلى
en: But whoever comes to Him (Allah) as a believer (in the Oneness of Allah), and has done righteous good deeds, for such are the high ranks (in the Hereafter), -

source: جنات عدن تجري من تحتها الأنهار خالدين فيها وذلك جزاء من تزكى
en: 'Adn (Eden) Paradise (everlasting Gardens), under which rivers flow, wherein they will abide forever: such is the reward of those who purify themselves (by abstaining from all kinds of sins and evil deeds which Allah has forbidden and by doing all that Allah has ordained).

source: ولقد أوحينا إلى موسى أن أسر بعبادي فاضرب لهم طريقا في البحر يبسا لا تخاف دركا ولا تخشى
en: And indeed We revealed to Musa (Moses) (saying): "Travel by night with Ibadi (My slaves) and strike a dry path for them in the sea, fearing neither to be overtaken [by Fir'aun (Pharaoh)] nor being afraid (of drowning in the sea)."

source: فأتبعهم فرعون بجنوده فغشيهم من اليم ما غشيهم
en: Then Fir'aun (Pharaoh) pursued them with his hosts, but the sea-water completely overwhelmed them and covered them up.

source: وأضل فرعون قومه وما هدى
en: And Fir'aun (Pharaoh) led his people astray, and he did not guide them.

source: يا بني إسرائيل قد أنجيناكم من عدوكم وواعدناكم جانب الطور الأيمن ونزلنا عليكم المن والسلوى
en: O Children of Israel! We delivered you from your enemy, and We made a covenant with you on the right side of the Mount, and We sent down to you Al-Manna and quails,

source: كلوا من طيبات ما رزقناكم ولا تطغوا فيه فيحل عليكم غضبي ومن يحلل عليه غضبي فقد هوى
en: (Saying) eat of the Tayyibat (good lawful things) wherewith We have provided you, and commit no transgression or oppression therein, lest My Anger should justly descend on you. And he on whom My Anger descends, he is indeed perished. [Tafsir At-Tabari]

source: وإني لغفار لمن تاب وآمن وعمل صالحا ثم اهتدى
en: And verily, I am indeed forgiving to him who repents, believes (in My Oneness, and associates none in worship with Me) and does righteous good deeds, and then remains constant in doing them, (till his death).

source: وما أعجلك عن قومك يا موسى
en: "And what made you hasten from your people, O Musa (Moses)?"

source: قال هم أولاء على أثري وعجلت إليك رب لترضى
en: He said: "They are close on my footsteps: and I hastened to You, O my Lord, that You might be pleased."

source: قال فإنا قد فتنا قومك من بعدك وأضلهم السامري
en: (Allah) said: "Verily We have tried your people in your absence, and As-Samiri has led them astray."

source: فرجع موسى إلى قومه غضبان أسفا قال يا قوم ألم يعدكم ربكم وعدا حسنا أفطال عليكم العهد أم أردتم أن يحل عليكم غضب من ربكم فأخلفتم موعدي
en: Then Musa (Moses) returned to his people in a state of anger and sorrow. He said: "O my people! Did not your Lord promise you a fair promise? Did then the promise seem to you long in coming? Or did you desire that wrath should descend from your Lord on you, that you broke your promise to me (i.e disbelieving in Allah and worshipping the calf)?"

source: قالوا ما أخلفنا موعدك بملكنا ولكنا حملنا أوزارا من زينة القوم فقذفناها فكذلك ألقى السامري
en: They said: "We broke not the promise to you, of our own will, but we were made to carry the weight of the ornaments of the [Fir'aun's (Pharaoh)] people, then we cast them (into the fire), and that was what As-Samiri suggested."

source: فأخرج لهم عجلا جسدا له خوار فقالوا هذا إلهكم وإله موسى فنسي
en: Then he took out (of the fire) for them (a statue of) a calf which seemed to low. They said: "This is your ilah (god), and the ilah (god) of Musa (Moses), but he [Musa (Moses)] has forgotten (his god).'"

source: أفلا يرون ألا يرجع إليهم قولا ولا يملك لهم ضرا ولا نفعا
en: Did they not see that it could not return them a word (for answer), and that it had no power either to harm them or to do them good?

source: ولقد قال لهم هارون من قبل يا قوم إنما فتنتم به وإن ربكم الرحمن فاتبعوني وأطيعوا أمري
en: And Harun (Aaron) indeed had said to them beforehand: "O my people! You are being tried in this, and verily, your Lord is (Allah) the Most Gracious, so follow me and obey my order."

source: قالوا لن نبرح عليه عاكفين حتى يرجع إلينا موسى
en: They said: "We will not stop worshipping it (i.e. the calf), until Musa (Moses) returns to us."

source: قال يا هارون ما منعك إذ رأيتهم ضلوا
en: [Musa (Moses)] said: "O Harun (Aaron)! What prevented you when you saw them going astray;

source: ألا تتبعن أفعصيت أمري
en: "That you followed me not (according to my advice to you)? Have you then disobeyed my order?"

source: قال يا ابن أم لا تأخذ بلحيتي ولا برأسي إني خشيت أن تقول فرقت بين بني إسرائيل ولم ترقب قولي
en: He [Harun (Aaron)] said: "O son of my mother! Seize (me) not by my beard, nor by my head! Verily, I feared lest you should say: 'You have caused a division among the Children of Israel, and you have not respected my word!' "

source: قال فما خطبك يا سامري
en: [Musa (Moses)] said: "And what is the matter with you. O Samiri? (i.e. why did you do so?)"

source: قال بصرت بما لم يبصروا به فقبضت قبضة من أثر الرسول فنبذتها وكذلك سولت لي نفسي
en: (Samiri) said: "I saw what they saw not, so I took a handful (of dust) from the (hoof) print of the messenger [Jibril's (Gabriel) horse] and threw it [into the fire in which were put the ornaments of Fir'aun's (Pharaoh) people, or into the calf]. Thus my inner-self suggested to me."

source: قال فاذهب فإن لك في الحياة أن تقول لا مساس وإن لك موعدا لن تخلفه وانظر إلى إلهك الذي ظلت عليه عاكفا لنحرقنه ثم لننسفنه في اليم نسفا
en: Musa (Moses) said: "Then go away! And verily, your (punishment) in this life will be that you will say: "Touch me not (i.e. you will live alone exiled away from mankind); and verily (for a future torment), you have a promise that will not fail. And look at your ilah (god) to which you have been devoted. We will certainly burn it, and scatter its particles in the sea."

source: إنما إلهكم الله الذي لا إله إلا هو وسع كل شيء علما
en: Your Ilah (God) is only Allah, (the One) La ilaha illa Huwa (none has the right to be worshipped but He). He has full knowledge of all things.

source: كذلك نقص عليك من أنباء ما قد سبق وقد آتيناك من لدنا ذكرا
en: Thus We relate to you (O Muhammad صلى الله عليه وسلم) some information of what happened before. And indeed We have given you from Us a Reminder (this Qur'an).

source: من أعرض عنه فإنه يحمل يوم القيامة وزرا
en: Whoever turns away from it (this Qur'an - i.e. does not believe in it, nor acts on its orders), verily, they will bear a heavy burden (of sins) on the Day of Resurrection,

source: خالدين فيه وساء لهم يوم القيامة حملا
en: They will abide in that (state in the Fire of Hell) - and evil indeed will it be that load for them on the Day of Resurrection;

source: يوم ينفخ في الصور ونحشر المجرمين يومئذ زرقا
en: The Day when the Trumpet will be blown (the second blowing): that Day, We shall gather the Mujrimun (criminals, polytheists, sinners, disbelievers in the Oneness of Allah) blue or blind-eyed with thirst.

source: يتخافتون بينهم إن لبثتم إلا عشرا
en: They will speak in a very low voice to each other (saying): "You stayed not longer than ten (days)."

source: نحن أعلم بما يقولون إذ يقول أمثلهم طريقة إن لبثتم إلا يوما
en: We know very well what they will say, when the best among them in knowledge and wisdom will say: "You stayed no longer than a day!"

source: ويسألونك عن الجبال فقل ينسفها ربي نسفا
en: And they ask you concerning the mountains: say, "My Lord will blast them and scatter them as particles of dust.

source: فيذرها قاعا صفصفا
en: "Then He shall leave them as a level smooth plain.

source: لا ترى فيها عوجا ولا أمتا
en: "You will see therein nothing crooked or curved."

source: يومئذ يتبعون الداعي لا عوج له وخشعت الأصوات للرحمن فلا تسمع إلا همسا
en: On that Day mankind will follow strictly (the voice of) Allah's caller, no crookedness (that is without going to the right or left of that voice) will they show him (Allah's caller). And all voices will be humbled for the Most Gracious (Allah), and nothing shall you hear but the low voice of their footsteps.

source: يومئذ لا تنفع الشفاعة إلا من أذن له الرحمن ورضي له قولا
en: On that day no intercession shall avail, except the one for whom the Most Gracious (Allah) has given permission and whose word is acceptable to Him.

source: يعلم ما بين أيديهم وما خلفهم ولا يحيطون به علما
en: He (Allah) knows what happens to them (His creatures) in this world, and what will happen to them (in the Hereafter) but they will never compass anything of His Knowledge.

source: وعنت الوجوه للحي القيوم وقد خاب من حمل ظلما
en: And (all) faces shall be humbled before (Allah), Al-Hayyul-Qayyum (the Ever Living, the One Who sustains and protects all that exists). And he who carried (a burden of) wrongdoing (i.e. he who disbelieved in Allah, ascribed partners to Him, and did deeds of His disobedience), will be indeed a complete failure (on that Day).

source: ومن يعمل من الصالحات وهو مؤمن فلا يخاف ظلما ولا هضما
en: And he who works deeds of righteousness, while he is a believer (in Islamic Monotheism), then he will have no fear of injustice, nor of any curtailment (of his reward).

source: وكذلك أنزلناه قرآنا عربيا وصرفنا فيه من الوعيد لعلهم يتقون أو يحدث لهم ذكرا
en: And thus We have sent it down as a Qur'an in Arabic, and have explained therein in detail the warnings, in order that they may fear Allah, or that it may cause them to have a lesson from it (or to have the honour for believing and acting on its teachings).

source: فتعالى الله الملك الحق ولا تعجل بالقرآن من قبل أن يقضى إليك وحيه وقل رب زدني علما
en: Then High above all be Allah, the True King. And be not in haste (O Muhammad صلى الله عليه وسلم) with the Qur'an before its revelation is completed to you, and say: "My Lord! Increase me in knowledge."

source: ولقد عهدنا إلى آدم من قبل فنسي ولم نجد له عزما
en: And indeed We made a covenant with Adam before, but he forgot, and We found on his part no firm will-power.

source: وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس أبى
en: And (remember) when We said to the angels: "Prostrate yourselves to Adam." They prostrated themselves (all) except Iblis (Satan) he refused.

source: فقلنا يا آدم إن هذا عدو لك ولزوجك فلا يخرجنكما من الجنة فتشقى
en: Then We said: "O Adam! Verily, this is an enemy to you and to your wife. So let him not get you both out of Paradise, so that you will be distressed.

source: إن لك ألا تجوع فيها ولا تعرى
en: Verily, you have (a promise from Us) that you will never be hungry therein nor naked.

source: وأنك لا تظمأ فيها ولا تضحى
en: And you (will) suffer not from thirst therein nor from the sun's heat.

source: فوسوس إليه الشيطان قال يا آدم هل أدلك على شجرة الخلد وملك لا يبلى
en: Then Shaitan (Satan) whispered to him, saying: "O Adam! Shall I lead you to the Tree of Eternity and to a kingdom that will never waste away?"

source: فأكلا منها فبدت لهما سوآتهما وطفقا يخصفان عليهما من ورق الجنة وعصى آدم ربه فغوى
en: Then they both ate of the tree, and so their private parts became manifest to them, and they began to cover themselves with the leaves of the Paradise for their covering. Thus did Adam disobey his Lord, so he went astray.

source: ثم اجتباه ربه فتاب عليه وهدى
en: Then his Lord chose him, and turned to him with forgiveness, and gave him guidance.

source: قال اهبطا منها جميعا بعضكم لبعض عدو فإما يأتينكم مني هدى فمن اتبع هداي فلا يضل ولا يشقى
en: He (Allah) said: "Get you down (from the Paradise to the earth), both of you, together, some of you are an enemy to some others. Then if there comes to you guidance from Me, then whoever follows My Guidance he shall neither go astray, nor shall be distressed.

source: ومن أعرض عن ذكري فإن له معيشة ضنكا ونحشره يوم القيامة أعمى
en: "But whosoever turns away from My Reminder (i.e. neither believes in this Qur'an nor acts on its teachings.) verily, for him is a life of hardship, and We shall raise him up blind on the Day of Resurrection."

source: قال رب لم حشرتني أعمى وقد كنت بصيرا
en: He will say: "O my Lord! Why have you raised me up blind, while I had sight (before)."

source: قال كذلك أتتك آياتنا فنسيتها وكذلك اليوم تنسى
en: (Allah) will say: "Like this: Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) came unto you, but you disregarded them (i.e. you left them, did not think deeply in them, and you turned away from them), and so this Day, you will be neglected (in the Hell-fire, away from Allah's Mercy)."

source: وكذلك نجزي من أسرف ولم يؤمن بآيات ربه ولعذاب الآخرة أشد وأبقى
en: And thus do We requite him who transgresses beyond bounds [i.e. commits the great sins and disobeys his Lord (Allah) and believes not in His Messengers, and His revealed Books, like this Qur'an], and believes not in the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of his Lord; and the torment of the Hereafter is far more severe and more lasting.

source: أفلم يهد لهم كم أهلكنا قبلهم من القرون يمشون في مساكنهم إن في ذلك لآيات لأولي النهى
en: Is it not a guidance for them (to know) how many generations We have destroyed before them, in whose dwellings they walk? Verily, in this are signs indeed for men of understanding.

source: ولولا كلمة سبقت من ربك لكان لزاما وأجل مسمى
en: And had it not been for a Word that went forth before from your Lord, and a term determined, (their punishment) must necessarily have come (in this world).

source: فاصبر على ما يقولون وسبح بحمد ربك قبل طلوع الشمس وقبل غروبها ومن آناء الليل فسبح وأطراف النهار لعلك ترضى
en: So bear patiently (O Muhammad صلى الله عليه وسلم) what they say, and glorify the praises of your Lord before the rising of the sun, and before its setting, and during some hours of the night, and at the ends of the day (an indication for the five compulsory congregational prayers), that you may become pleased (with the reward which Allah shall give you).

source: ولا تمدن عينيك إلى ما متعنا به أزواجا منهم زهرة الحياة الدنيا لنفتنهم فيه ورزق ربك خير وأبقى
en: And strain not your eyes in longing for the things We have given for enjoyment to various groups of them (polytheists and disbelievers in the Oneness of Allah), the splendour of the life of this world, that We may test them thereby. But the provision (good reward in the Hereafter) of your Lord is better and more lasting.

source: وأمر أهلك بالصلاة واصطبر عليها لا نسألك رزقا نحن نرزقك والعاقبة للتقوى
en: And enjoin As-Salat (the prayer) on your family, and be patient in offering them [i.e. the Salat (prayers)]. We ask not of you a provision (i.e. to give Us something: money): We provide for you. And the good end (i.e. Paradise) is for the Muttaqun (the pious - See V.2:2).

source: وقالوا لولا يأتينا بآية من ربه أولم تأتهم بينة ما في الصحف الأولى
en: They say: "Why does he not bring us a sign (proof) from his Lord?" Has there not come to them the proof of that which is (written) in the former papers [Scriptures, i.e. the Taurat (Torah), and the Injeel (Gospel), about the coming of the Prophet Muhammad صلى الله عليه وسلم]?

source: ولو أنا أهلكناهم بعذاب من قبله لقالوا ربنا لولا أرسلت إلينا رسولا فنتبع آياتك من قبل أن نذل ونخزى
en: And if We had destroyed them with a torment before this (i.e. Messenger Muhammad صلى الله عليه وسلم and the Qur'an), they would surely have said: "Our Lord! If only You had sent us a Messenger, we should certainly have followed Your Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), before we were humiliated and disgraced."

source: قل كل متربص فتربصوا فستعلمون من أصحاب الصراط السوي ومن اهتدى
en: Say (O Muhammad صلى الله عليه وسلم): "Each one (believer and disbeliever.) is waiting, so wait you too; and you shall know who are they that are on the Straight and Even Path (i.e. Allah's religion of Islamic Monotheism), and who are they that have let themselves be guided (on the Right Path).

source: اقترب للناس حسابهم وهم في غفلة معرضون
en: Draws near for mankind their reckoning, while they turn away in heedlessness.

source: ما يأتيهم من ذكر من ربهم محدث إلا استمعوه وهم يلعبون
en: Comes not unto them an admonition (a chapter of the Qur'an) from their Lord as a recent revelation but they listen to it while they play
